tutorialsDyM/2DCylinderUniformGranularFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | | \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     overSedDymFoam_rbgh;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         8;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           0.01;

maxAlphaCo      0.01;

maxDeltaT       1.e-4;

functions
{
forcesSed
{
    type          forcesSed;
    libs          ("libforcesSedFoam.so");
    writeControl  timeStep;
    timeInterval  1;
    patches       ("cylinder");
    rho           rhoInf;     // Indicates incompressible
    log           true;
    rhoInf        2500; // Redundant for incompressible
    origin (0 0 0); 
    rotation
        {
            type            axes;
            e3              (0 0 1);
            e1              (1 0 0);
        }
}
}


 
// ************************************************************************* //
